# BBA1

# BBA1 – Base Configuration (Cisco Router)

## 1. Objective

Deploy a consistent and secure base configuration on router **BBA1**, including hostname, SSH, NAT/PAT, ACLs, static routing, and IPsec port forwarding.

---

## 2. Hardware

- Cisco Router **CISCO2911/K9**

---

## 3. Hostname

```
BBA1(config)# hostname BBA1

```

---

## 4. Secure Privileged EXEC Mode

```
BBA1(config)# enable secret formation

```

---

## 5. Secure Console Access

```
BBA1(config)# line con 0
BBA1(config-line)# password formation
BBA1(config-line)# logging synchronous
BBA1(config-line)# login

```

---

## 6. Encrypt Plaintext Passwords

```
BBA1(config)# service password-encryption

```

---

## 7. Login Attempt Protection

```
BBA1(config)# login block-for 30 attempts 3 within 15

```

---

## 8. MOTD Banner

```
BBA1(config)# banner motd $Authorized Access Only$

```

---

## 9. Set Time and Date

```
BBA1# clock set 20:40:00 14 November 2025

```

---

## 10. Local User Accounts

```
BBA1(config)# username constantin privilege 15 secret constantin1
BBA1(config)# username quentin privilege 15 secret quentin1
BBA1(config)# username arnaud privilege 15 secret arnaud1
BBA1(config)# username maxime privilege 15 secret maxime1
BBA1(config)# username philippe privilege 15 secret philippe1
BBA1(config)# username samuelg privilege 15 secret samuelg1
BBA1(config)# username samuell privilege 15 secret samuell1
BBA1(config)# username jeanfrancois privilege 15 secret jeanfrancois1
BBA1(config)# username mathieu privilege 15 secret mathieu1
BBA1(config)# username julien privilege 15 secret julien1
BBA1(config)# username solenne privilege 15 secret solenne1
BBA1(config)# username charles privilege 15 secret charles1
BBA1(config)# username admin secret formation

```

---

## 11. SSH Configuration

### 11.1 Domain Name

```
BBA1(config)# ip domain-name infra.labo
```

### 11.2 Generate RSA Keys

```
BBA1(config)# crypto key generate rsa general-keys modulus 2048

```

### 11.3 Enable SSH v2

```
BBA1(config)# ip ssh version 2

```

### 11.4 Configure VTY Lines

```
BBA1(config)# line vty 0 4
BBA1(config-line)# transport input ssh
BBA1(config-line)# login local
BBA1(config-line)# exec-timeout 10 0
BBA1(config-line)# logging synchronous

```

---

## 12. Interface Configuration

### 12.1 Internet-facing Interface (Outside)

```
BBA1(config)# interface g0/0
BBA1(config-if)# description Link to Internet
BBA1(config-if)# ip address 172.20.192.100 255.255.255.0
BBA1(config-if)# ip nat outside
BBA1(config-if)# no shutdown

```

### 12.2 SGN1-facing Interface (Inside)

```
BBA1(config)# interface g0/1
BBA1(config-if)# description Link to SGN1
BBA1(config-if)# ip address 100.64.1.254 255.255.255.0
BBA1(config-if)# ip nat inside
BBA1(config-if)# no shutdown

```

---

## 13. Default Route

```
BBA1(config)# ip route 0.0.0.0 0.0.0.0 172.29.192.1

```

---

## 14. NAT / PAT Configuration

### 14.1 ACL 10 – Allowed Inside Networks

```
BBA1(config)# access-list 10 permit 100.64.1.0 0.0.0.255
BBA1(config)# access-list 10 deny any log

```

### 14.2 PAT

```
BBA1(config)# ip nat inside source list 10 interface GigabitEthernet0/0 overload

```

---

## 15. Static Routes to Internal Networks

```
BBA1(config)# ip route 172.20.1.0 255.255.255.0 100.64.1.1
BBA1(config)# ip route 172.20.2.0 255.255.255.0 100.64.1.1
BBA1(config)# ip route 172.20.3.0 255.255.255.0 100.64.1.1
BBA1(config)# ip route 172.20.4.0 255.255.255.0 100.64.1.1
BBA1(config)# ip route 172.20.10.0 255.255.255.0 100.64.1.1
BBA1(config)# ip route 172.20.20.0 255.255.255.0 100.64.1.1
BBA1(config)# ip route 172.20.21.0 255.255.255.0 100.64.1.1
BBA1(config)# ip route 172.20.22.0 255.255.255.0 100.64.1.1
BBA1(config)# ip route 172.20.23.0 255.255.255.0 100.64.1.1

BBA1(config)# ip route 10.20.5.1 255.255.255.255 100.64.1.1
BBA1(config)# ip route 10.20.5.253 255.255.255.255 100.64.1.1
BBA1(config)# ip route 10.20.6.1 255.255.255.255 100.64.1.1
BBA1(config)# ip route 10.20.6.253 255.255.255.255 100.64.1.1
BBA1(config)# ip route 10.20.8.1 255.255.255.255 100.64.1.1
BBA1(config)# ip route 10.20.8.253 255.255.255.255 100.64.1.1
BBA1(config)# ip route 10.20.9.1 255.255.255.255 100.64.1.1
BBA1(config)# ip route 10.20.9.253 255.255.255.255 100.64.1.1

```

---

## 16. IPsec Port Forwarding

### UDP/500 (IKE)

```
BBA1(config)# ip nat inside source static udp 100.64.1.1 500 interface GigabitEthernet0/0 500

```

### UDP/4500 (NAT-T)

```
BBA1(config)# ip nat inside source static udp 100.64.1.1 4500 interface GigabitEthernet0/0 4500
```

### ESP

```
BBA1(config)# ip nat inside source static esp 100.64.1.1 interface GigabitEthernet0/0

```

---

## 17. Save Configuration

```
BBA1# copy run start

```

---

## 18. Verification Commands

```
show run
show ip interface brief
show ip route
show ip nat translations
show access-list 10
show ssh
show users

```