# R1

# R1 â€“ **Base, LAN/WAN & NAT Configuration (Cisco Router)**

## 1. Objective

Deploy a clean, standardized, and secure base configuration on router **R1**, including hostname, local authentication, SSH security, WAN/LAN addressing, NAT/PAT, ACLs, static routing, NTP server, and VPN.

---

## 2. Hardware

- Cisco Router **Cisco 2911/K9**

---

## 3. Hostname

```
R1(config)# hostname R1

```

---

## 4. Secure Privileged EXEC Mode

```
R1(config)# enable secret formation

```

---

## 5. Secure Console Access

```
R1(config)# line con 0
R1(config-line)# password formation
R1(config-line)# login
R1(config-line)# logging synchronous

```

---

## 6. Encrypt All Plaintext Passwords

```
R1(config)# service password-encryption

```

---

## 7. Login Attempt Protection

```
R1(config)# login block-for 30 attempts 3 within 15

```

---

## 8. MOTD Banner

```
R1(config)# banner motd $Authorized Access Only$

```

---

## 9. Local User Accounts

```
R1(config)# username constantin privilege 15 secret constantin1
R1(config)# username quentin privilege 15 secret quentin1
R1(config)# username arnaud privilege 15 secret arnaud1
R1(config)# username maxime privilege 15 secret maxime1
R1(config)# username philippe privilege 15 secret philippe1
R1(config)# username samuelg privilege 15 secret samuelg1
R1(config)# username samuell privilege 15 secret samuell1
R1(config)# username jeanfrancois privilege 15 secret jeanfrancois1
R1(config)# username mathieu privilege 15 secret mathieu1
R1(config)# username julien privilege 15 secret julien1
R1(config)# username solenne privilege 15 secret solenne1
R1(config)# username charles privilege 15 secret charles1

```

---

## 10. SSH Configuration

### 10.1 Domain Name

```
R1(config)# ip domain-name infra.labo

```

### 10.2 Administrator User

```
R1(config)# username admin secret formation

```

### 10.3 Generate RSA Keys

```
R1(config)# crypto key generate rsa general-keys modulus 2048

```

### 10.4 Enable SSH v2

```
R1(config)# ip ssh version 2

```

### 10.5 Configure VTY Lines

```
R1(config)# line vty 0 15
R1(config-line)# transport input ssh
R1(config-line)# login local
R1(config-line)# exec-timeout 10 0
R1(config-line)# logging synchronous

```

---

## 11. Interface Configuration

### 11.1 WAN Interface (g0/0)

```
R1(config)# interface g0/0
R1(config-if)# description Link to CGN1
R1(config-if)# ip address 100.64.1.1 255.255.255.0
R1(config-if)# ip nat outside
R1(config-if)# no shutdown

```

### 11.2 Wan interface ACL

```bash
R1(config)# ip access-list extended ACL_G0-0_OUT
R1(config-ext-nacl)# permit ip host 100.64.1.1 any
R1(config-ext-nacl)#deny ip any any log

R1(config)# interface GigabitEthernet0/0
R1(config)# ip access-group ACL_G0-0_OUT out
```

### 11.3 LAN Interface (g0/1)

```
R1(config)# interface g0/1
R1(config-if)# description Link to FW1
R1(config-if)# ip address 10.20.2.254 255.255.255.0
R1(config-if)# ip nat inside
R1(config-if)# no shutdown

```

---

## 12. NAT/PAT Configuration

### 12.1 NAT Inside Interface

```
R1(config)# interface g0/0
R1(config-if)# ip nat outside

R1(config)# interface g0/1
R1(config-if)# ip nat inside
```

### 12.2 ACL for NAT Inside Networks

```
R1(config)# ip access-list extended ACL_NAT_R1
R1(config-ext-nacl)# permit ip 172.20.10.0 0.0.0.255 any
R1(config-ext-nacl)# permit ip 172.20.20.0 0.0.0.255 any
R1(config-ext-nacl)# permit ip 172.20.21.0 0.0.0.255 any
R1(config-ext-nacl)# permit ip 172.20.22.0 0.0.0.255 any
R1(config-ext-nacl)# permit ip 172.20.23.0 0.0.0.255 any
R1(config-ext-nacl)# permit ip 172.20.1.0 0.0.0.255 any
R1(config-ext-nacl)# permit ip 172.20.2.0 0.0.0.255 any
R1(config-ext-nacl)# permit ip 172.20.3.0 0.0.0.255 any
R1(config-ext-nacl)# permit ip 172.20.4.0 0.0.0.255 any
R1(config-ext-nacl)# permit ip 172.20.30.0 0.0.0.255 any
R1(config-ext-nacl)# permit ip 10.20.0.0 0.0.255.255 any
R1(config-ext-nacl)#deny ip any any log
```

### 12.3 NAT/PAT Overload

```
R1(config)# ip nat inside source list ACL_NAT_R1 interface GigabitEthernet0/0 overload
```

---

## 13. Static Routes (Internal Networks)

```
R1(config)# ip route 0.0.0.0 0.0.0.0 via 100.64.1.254
R1(config)# ip route 10.20.1.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 10.20.3.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 10.20.4.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 10.20.5.1 255.255.255.255 via 10.20.2.1
R1(config)# ip route 10.20.5.253 255.255.255.255 via 10.20.2.1
R1(config)# ip route 10.20.6.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 10.20.6.1 255.255.255.255 via 10.20.2.1
R1(config)# ip route 10.20.6.253 255.255.255.255 via 10.20.2.1
R1(config)# ip route 10.20.8.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 10.20.8.1 255.255.255.255 via 10.20.2.1
R1(config)# ip route 10.20.8.253 255.255.255.255 via 10.20.2.1
R1(config)# ip route 10.20.9.1 255.255.255.255 via 10.20.2.1
R1(config)# ip route 10.20.9.253 255.255.255.255 via 10.20.2.1
R1(config)# ip route 10.20.10.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 100.64.2.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 172.20.1.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 172.20.2.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 172.20.3.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 172.20.4.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 172.20.10.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 172.20.20.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 172.20.21.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 172.20.22.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 172.20.23.0 255.255.255.0 via 10.20.2.1
R1(config)# ip route 172.20.30.0 255.255.255.0 via 10.20.2.1

```

---

## 14. Syslog Forwarding

```
R1(config)# logging trap notifications
R1(config)# logging origin-id hostname
R1(config)# logging host 172.20.21.14

```

---

## 15. NTP Configuration

```
confR1(config)# ntp server 0.be.pool.ntp.org prefer
R1(config)# ntp server 1.be.pool.ntp.org
R1(config)# ntp server 2.be.pool.ntp.org
R1(config)# ntp master 4
R1(config)# ntp update-calendar
R1(config)# clock timezone UTC 1 
R1(config)# clock summer-time CEST recurring last Sun Mar 2:00 last Sun Oct 3:00
```

---

## 16 . Port Forwarding

### Port forwarding for Distant VPN to Fw1

```bash
ip nat inside source static udp 10.20.2.1 500 interface GigabitEthernet0/0 500
ip nat inside source static udp 10.20.2.1 4500 interface GigabitEthernet0/0 4500

```

### Port forwarding for Web server acces

```bash
ip nat inside source static tcp 172.20.3.80 80 100.64.1.1 3080 extendable
ip nat inside source static tcp 172.20.3.80 443 100.64.1.1 30443 extendable

```

---

## 17. Save Configuration

```
R1# copy run start

```

---

## 18. Validation Commands

Common validation:

- show ip interface brief
- show running-config
- show ip route
- show logging
- show ntp associations

---