# R2

# R2 â€“ Base, LAN/WAN & NAT Configuration (Cisco Router)

## 1. Objective

Deploy a clean, standardized, and secure base configuration on router **R2**, including hostname, local authentication, SSH security, WAN/LAN addressing, NAT/PAT, ACLs, static routing, NTP, and preparation for VPN integration.

---

## 2. Hardware

- Cisco Router **Cisco 2911/K9**

---

## 3. Hostname

```
R2(config)# hostname R2

```

---

## 4. Secure Privileged EXEC Mode

```
R2(config)# enable secret formation

```

---

## 5. Secure Console Access

```
R2(config)# line con 0
R2(config-line)# password formation
R2(config-line)# logging synchronous
R2(config-line)# login

```

---

## 6. Encrypt All Plaintext Passwords

```
R2(config)# service password-encryption

```

---

## 7. Login Attempt Protection

```
R2(config)# login block-for 30 attempts 3 within 15

```

---

## 8. MOTD Banner

```
R2(config)# banner motd $Authorized Access Only$

```

---

## 9. Local User Accounts

```
R2(config)# username constantin privilege 15 secret constantin1
R2(config)# username quentin privilege 15 secret quentin1
R2(config)# username arnaud privilege 15 secret arnaud1
R2(config)# username maxime privilege 15 secret maxime1
R2(config)# username philippe privilege 15 secret philippe1
R2(config)# username samuelg privilege 15 secret samuelg1
R2(config)# username samuell privilege 15 secret samuell1
R2(config)# username jeanfrancois privilege 15 secret jeanfrancois1
R2(config)# username mathieu privilege 15 secret mathieu1
R2(config)# username julien privilege 15 secret julien1
R2(config)# username solenne privilege 15 secret solenne1
R2(config)# username charles privilege 15 secret charles1

```

---

## 10. SSH Configuration

### 10.1 Domain Name

```
R2(config)# ip domain-name infra.labo

```

### 10.2 Administrator User

```
R2(config)# username admin secret formation

```

### 10.3 Generate RSA Keys

```
R2(config)# crypto key generate rsa general-keys modulus 2048

```

### 10.4 Enable SSH v2

```
R2(config)# ip ssh version 2

```

### 10.5 Configure VTY Lines

```
R2(config)# line vty 0 15
R2(config-line)# transport input ssh
R2(config-line)# login local
R2(config-line)# exec-timeout 10 0
R2(config-line)# logging synchronous

```

---

## 11. Interface Configuration

### 11.1 WAN Interface (g0/0)

```
R2(config)# interface g0/0
R2(config-if)# description Link to CGN2
R2(config-if)# ip address 100.64.2.1 255.255.255.0
R2(config-if)# ip nat outside
R2(config-if)# no shutdown

```

### 11.2 Wan interface ACL

```bash
R2(config)# ip access-list extended ACL_G0-0_OUT
R2(config-ext-nacl)# permit ip host 100.64.2.1 any
R2(config-ext-nacl)# deny ip any any log

R2(config)# interface GigabitEthernet0/0
R2(config)# ip access-group ACL_G0-0_OUT out
```

### 11.3 LAN Interface (g0/1)

```
R2(config)# interface g0/1
R2(config-if)# description Link to FW2
R2(config-if)# ip address 10.20.4.254 255.255.255.0
R2(config-if)# ip nat inside
R2(config-if)# no shutdown
```

### 11.4 VPN Tunnel10

```bash
R3(config)# interface tunnel10
R3(config-if)# description Vpn to R3
R3(config-if)# ip address 10.200.10.1 255.255.255.252
R3(config-if)# tunnel source GigabitEthernet0/0
R3(config-if)# tunnel mode ipsec ipv4
R3(config-if)# tunnel destination 100.64.2.2
R3(config-if)# tunnel protection ipsec profile PROF-R3-R2
```

11.5 Vpn acl

```bash
R2(config)# ip access-list extended ACL_To_SIEM
R2(config-ext-nacl)# remark DNS1 pve1
R2(config-ext-nacl)# permit tcp host 172.20.21.53 host 192.168.1.1 eq 9997
R2(config-ext-nacl)# remark DHCP1 pve1
R2(config-ext-nacl)# permit tcp host 172.20.21.67 host 192.168.1.1 eq 9997
R2(config-ext-nacl)# remark LOG1 pve1
R2(config-ext-nacl)# permit tcp host 172.20.21.14 host 192.168.1.1 eq 9997
R2(config-ext-nacl)# remark DNS2 pve2
R2(config-ext-nacl)# permit tcp host 172.20.23.53 host 192.168.1.1 eq 9997
R2(config-ext-nacl)# remark DHCP2 pve2
R2(config-ext-nacl)# permit tcp host 172.20.23.67 host 192.168.1.1 eq 9997
R2(config-ext-nacl)# remark CA2 pve2
R2(config-ext-nacl)# permit tcp host 172.20.23.90 host 192.168.1.1 eq 9997
R2(config-ext-nacl)# remark AD1 pve1
R2(config-ext-nacl)# permit tcp host 172.20.20.1 host 192.168.1.1 eq 9997
R2(config-ext-nacl)# remark FS1 pve1
R2(config-ext-nacl)# permit tcp host 172.20.20.2 host 192.168.1.1 eq 9997
R2(config-ext-nacl)# remark FS2 pve2
R2(config-ext-nacl)# permit tcp host 172.20.22.2 host 192.168.1.1 eq 9997
R2(config-ext-nacl)# remark AD2 pve2
R2(config-ext-nacl)# permit tcp host 172.20.22.1 host 192.168.1.1 eq 9997
R2(config-ext-nacl)# remark TFTP1 pve1
R2(config-ext-nacl)# permit tcp host 172.20.21.63 host 192.168.1.1 eq 9997
R2(config-ext-nacl)# remark MX1 pve1
R2(config-ext-nacl)# permit tcp host 172.20.21.89 host 192.168.1.1 eq 9997
R2(config-ext-nacl)# remark Labo management acces R1-fw3-pve3-splunk
R2(config-ext-nacl)# permit tcp 172.20.10.0 0.0.0.255 host 192.168.2.254 eq 22
R2(config-ext-nacl)# permit tcp 172.20.10.0 0.0.0.255 host 192.168.1.254 eq 22
R2(config-ext-nacl)# permit tcp 172.20.10.0 0.0.0.255 host 192.168.1.254 eq 80
R2(config-ext-nacl)# permit tcp 172.20.10.0 0.0.0.255 host 192.168.1.254 eq 443
R2(config-ext-nacl)# permit tcp 172.20.10.0 0.0.0.255 host 192.168.1.253 eq 8006
R2(config-ext-nacl)# permit tcp 172.20.10.0 0.0.0.255 host 192.168.1.253 eq 22
R2(config-ext-nacl)# permit tcp 172.20.10.0 0.0.0.255 host 192.168.1.1 eq 8000
R2(config-ext-nacl)# permit tcp 172.20.10.0 0.0.0.255 host 192.168.1.1 eq 22
R2(config-ext-nacl)# deny ip any any log
```

---

## 12. NAT/PAT Configuration

### 12.1 ACL for NAT Inside Networks

```
R2(config)# ip access-list extended ACL_NAT_R2
R2(config-ext-nacl)# permit ip 172.20.10.0 0.0.0.255 any
R2(config-ext-nacl)# permit ip 172.20.20.0 0.0.0.255 any
R2(config-ext-nacl)# permit ip 172.20.21.0 0.0.0.255 any
R2(config-ext-nacl)# permit ip 172.20.22.0 0.0.0.255 any
R2(config-ext-nacl)# permit ip 172.20.23.0 0.0.0.255 any
R2(config-ext-nacl)# permit ip 172.20.1.0 0.0.0.255 any
R2(config-ext-nacl)# permit ip 172.20.2.0 0.0.0.255 any
R2(config-ext-nacl)# permit ip 172.20.3.0 0.0.0.255 any
R2(config-ext-nacl)# permit ip 172.20.4.0 0.0.0.255 any
R2(config-ext-nacl)# permit ip 172.20.30.0 0.0.0.255 any
R2(config-ext-nacl)# permit ip 10.20.0.0 0.0.255.255 any
R2(config-ext-nacl)#deny ip any any log

```

### 12.2 NAT/PAT Overload

```
R2(config)# ip nat inside source list ACL_NAT_R2 interface GigabitEthernet0/0 overload
```

---

## 13. Static Routing

```
R2(config)# ip route 0.0.0.0 0.0.0.0 via 100.64.2.254
R2(config)# ip route 10.20.1.0 255.255.255.0 via 10.20.10.1
R2(config)# ip route 10.20.1.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 10.20.2.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 10.20.3.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 10.20.5.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 10.20.5.1 255.255.255.255 via 10.20.4.1
R2(config)# ip route 10.20.5.253 255.255.255.255 via 10.20.4.1
R2(config)# ip route 10.20.6.1 255.255.255.255 via 10.20.4.1
R2(config)# ip route 10.20.6.253 255.255.255.255 via 10.20.4.1
R2(config)# ip route 10.20.8.1 255.255.255.255 via 10.20.4.1
R2(config)# ip route 10.20.8.253 255.255.255.255 via 10.20.4.1
R2(config)# ip route 10.20.9.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 10.20.9.1 255.255.255.255 via 10.20.4.1
R2(config)# ip route 10.20.9.253 255.255.255.255 via 10.20.4.1
R2(config)# ip route 10.20.10.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 100.64.1.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 172.20.1.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 172.20.2.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 172.20.3.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 172.20.4.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 172.20.10.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 172.20.20.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 172.20.21.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 172.20.22.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 172.20.23.0 255.255.255.0 via 10.20.4.1
R2(config)# ip route 192.168.1.0 255.255.255.0 via 10.200.10.2
R2(config)# ip route 192.168.2.0 255.255.255.0 via 10.200.10.2
```

---

## 14. Syslog Forwarding

```
R1(config)# logging trap notifications
R1(config)# logging origin-id hostname
R1(config)# logging host 172.20.21.14

```

---

## 15. NTP Configuration

```
R2(config)# ntp server 10.20.2.254
R2(config)# ntp update-calendar

```

---

## 16. VPN Preparation (No tunnel yet)

```
! All management and log traffic toward SIEM will later be routed
! inside the IPsec VTI tunnel.
! FW policies will separate management vs. log traffic.
(voir Document VPN/SIEM)
```

Voir page : 

[VPN/site-site/SIEM](https://www.notion.so/VPN-site-site-SIEM-2be6c6954d78803eb8efd942b12ef1ec?pvs=21)

---

## 17. Save Configuration

```
R2# copy run start

```

---

## 18. Validation Commands

Recommended:

- show ip interface brief
- show running-config
- show ip nat translations
- show access-lists
- show ip route
- show ntp associations

---