# R3

# R3 – Base, LAN/WAN, NAT & IP SLA Configuration (Cisco Router)

## 1. Objective

Deploy a clean, standardized, and secure base configuration on router **R3**, including hostname, authentication, SSH security, multi‑WAN interfaces, NAT/PAT, ACLs, IP SLA tracking, static routing, and NTP.

---

## 2. Hardware

- Cisco Router **Cisco 2911/K9**

---

## 3. Hostname

```
R3(config)# hostname R3

```

---

## 4. Secure Privileged EXEC Mode

```
R3(config)# enable secret formation

```

---

## 5. Secure Console Access

```
R3(config)# line con 0
R3(config-line)# password formation
R3(config-line)# login
R3(config-line)# logging synchronous

```

---

## 6. Encrypt All Plaintext Passwords

```
R3(config)# service password-encryption

```

---

## 7. Login Attempt Protection

```
R3(config)# login block-for 30 attempts 3 within 15

```

---

## 8. MOTD Banner

```
R3(config)# banner motd $Authorized Access Only$

```

---

## 9. Local User Accounts

```
R3(config)# username constantin privilege 15 secret constantin1
R3(config)# username quentin privilege 15 secret quentin1
R3(config)# username arnaud privilege 15 secret arnaud1
R3(config)# username maxime privilege 15 secret maxime1
R3(config)# username philippe privilege 15 secret philippe1
R3(config)# username samuelg privilege 15 secret samuelg1
R3(config)# username samuell privilege 15 secret samuell1
R3(config)# username jeanfrancois privilege 15 secret jeanfrancois1
R3(config)# username mathieu privilege 15 secret mathieu1
R3(config)# username julien privilege 15 secret julien1
R3(config)# username solenne privilege 15 secret solenne1
R3(config)# username charles privilege 15 secret charles1

```

---

## 10. SSH Configuration

### 10.1 Domain Name

```
R3(config)# ip domain-name infra.labo

```

### 10.2 Administrator User

```
R3(config)# username admin secret formation

```

### 10.3 RSA Key Generation

```
R3(config)# crypto key generate rsa general-keys modulus 2048

```

### 10.4 SSH v2

```
R3(config)# ip ssh version 2

```

### 10.5 VTY Configuration

```
R3(config)# line vty 0 15
R3(config-line)# transport input ssh
R3(config-line)# login local
R3(config-line)# exec-timeout 10 0
R3(config-line)# logging synchronous

```

---

## 11. Interface Configuration

### 11.1 LAN Interface (g0/0)

```
R3(config)# interface g0/0
R3(config-if)# description Link to FW3
R3(config-if)# ip address 192.168.2.254 255.255.255.0
R3(config-if)# no shutdown
```

### 11.2 WAN Interface 1 (g0/1)

```
R3(config)# interface g0/1
R3(config-if)# description Link to CGN1
R3(config-if)# ip address 100.64.1.2 255.255.255.0
R3(config-if)# ip nat outside
R3(config-if)# ip access-group ACL_G0-1_OUT out
R3(config-if)# no shutdown
```

### 11.3 Wan1 ACL

```bash
R3(config-if)# ip access-list extended ACL_G0-1_OUT
R3(config-if)# remark ACL no private ip on CGN
R3(config-if)# permit ip host 100.64.1.2 any
R3(config-if)# deny   ip any any log

```

### 11.4 WAN Interface 2 (g0/2)

```
R3(config)# interface g0/2
R3(config-if)# description Link to CGN2
R3(config-if)# ip address 100.64.2.2 255.255.255.0
R3(config-if)# ip nat outside
R3(config-if)# no shutdown
```

### 11.5 Wan2 ACL

```bash
R3(config)# ip access-list extended ACL_G0-2_OUT
R3(config)# remark ACL no private ip on CGN
R3(config)# permit ip host 100.64.2.2 any
R3(config)# deny   ip any any log
```

### 11.6 VPN Interface ( Tunnel10)

```bash
R3(config)# interface tunnel10
R3(config-if)# description Vpn to R2
R3(config-if)# ip address 10.200.10.2 255.255.255.252
R3(config-if)# tunnel source GigabitEthernet0/2
R3(config-if)# tunnel mode ipsec ipv4
R3(config-if)# tunnel destination 100.64.2.1
R3(config-if)# tunnel protection ipsec profile PROF-R3-R2
```

### 11.7 Vpn ACL

```bash
R3(config-if)# ip access-list extended ACL_To_Infra
R3(config-if)# remark Traffic SOC to INFRA
R3(config-if)# permit ip 192.168.0.0 0.0.3.255 172.20.10.0 0.0.0.255
R3(config-if)# permit ip 192.168.0.0 0.0.3.255 172.20.20.0 0.0.0.255
R3(config-if)# permit ip 192.168.0.0 0.0.3.255 172.20.21.0 0.0.0.255
R3(config-if)# permit ip 192.168.0.0 0.0.3.255 172.20.22.0 0.0.0.255
R3(config-if)# permit ip 192.168.0.0 0.0.3.255 172.20.23.0 0.0.0.255
R3(config-if)# deny ip any any log

```

---

## 12. NAT/PAT Configuration

### 12.1 NAT Inside Interface

```
R3(config)# interface g0/0
R3(config-if)# ip nat inside

R3(config)# interface g0/1
R3(config-if)# ip nat outside

R3(config)# interface g0/2
R3(config-if)# ip nat outside
```

### 12.2 PAT Overload

```
R3(config)# ip nat inside source route-map Nat-BBA1 interface GigabitEthernet0/1 overload

R3(config)# ip nat inside source route-map Nat-BBA2 interface GigabitEthernet0/2 overload
```

### 12.3 Apply ACLs on WAN Interfaces

```
R3(config-if)# route-map Nat-BBA1 permit 10
R3(config-if)# match ip address ACL_NAT_R3
R3(config-if)# match interface GigabitEthernet0/1

R3(config-if)# route-map Nat-BBA2 permit 10
R3(config-if)# match ip address ACL_NAT_R3
R3(config-if)# match interface GigabitEthernet0/2

```

---

## 13. Static Routes

### 13.1 Default Routes with Tracking

```
R3(config)# ip route 0.0.0.0 0.0.0.0 100.64.1.254 track 1
R3(config)# ip route 0.0.0.0 0.0.0.0 100.64.2.254 200
R3(config)# ip route 172.20.0.0 255.255.0.0 10.200.10.1
R3(config)# ip route 192.168.1.0 255.255.255.0 192.168.2.1
```

### 13.2. IP SLA Tracking

```
R3(config)# ip sla 1
R3(config-ip-sla)# icmp-echo 100.64.1.254 source-interface g0/1
R3(config-ip-sla)# frequency 5
R3(config-ip-sla)# timeout 5000
R3(config-ip-sla)# exit

R3(config)# ip sla schedule 1 life forever start-time now

R3(config)# track 1 ip sla 1 reachability

```

---

## 14. Syslog Forwarding

```
R3(config)# logging trap notifications
R3(config)# logging origin-id hostname
R3(config)# logging host 172.20.21.14

```

---

## 15. NTP Configuration

```
R3(config)# ntp server 100.64.1.1
R3(config)# ntp update-calendar
```

---

## 16. Save Configuration

```
R3# copy run start

```

---

## 17. Validation Commands

- show ip interface brief
- show running-config
- show ip nat translations
- show access-lists
- show ip route
- show ip sla statistics
- show ntp associations

---
